<template>
  <div></div>
</template>

<script>
// ** ====================================================
// ** 🌟 Importing Vue composition API 🌟
// ** ====================================================
import { ref } from "vue";

// ** ====================================================
// ** 🎯 Importing required components 🎯
// ** ====================================================

// ** ====================================================
// ** 🔧 Code Logic
// ** ====================================================

export default {
  name: "COMPONENTNAME",
  setup() {
    // ** 🔐 Composables

    // ** 📝 Variables

    // ** 📦 Methods

    // ** 💾 Returning reactive data
    return {};
  },
};
</script>
<style lang="scss">
/* ========================================
   🎨 Styles 🎨
======================================== */
</style>
